const data = [
  {
    title: "Стрелочные функции",
    date: [
      {
        text: "Два фактора повлияли на появление стрелочных функции: более короткий синтаксис и лексика this",
        img: "/Task2/src/pictures/arrowFunction/img1.PNG",
      },
      {
        text: `У стрелочных функций нет this. Если происходит обращение к this, его значение берётся снаружи.
Если бы мы использовали обычную функцию, была бы ошибка.`,
        img: "/Task2/src/pictures/arrowFunction/img2.PNG",
      },
    ],
  },
  {
    title: "Классы",
    date: [
      {
        text: "Добавлен более удобный синтаксис, удобное наследование. Доступен функционал геттеров и сеттеров",
        img: "/Task2/src/pictures/arrowFunction/img1.PNG",
      },
      {
        text: ` За счет того что метод который определен как статический можно к нему обращаться на прямую.`,
        img: "/Task2/src/pictures/arrowFunction/img2.PNG",
      },
    ],
  },
];
